Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J79.tmx
Source language: en_us
Languages: zh_cn

source: 3 Kinematics
zh_cn: 第3章 运动学

source: 3.1 Introduction In this chapter kinematic analysis of parallel robots is discussed in detail.
zh_cn: 3. 1 简介本章详细讨论并联机器人的运动学分析。

source: Kinematic analysis refers to the study of the geometry of motion of a robot, without considering the forces and torques that cause the motion.
zh_cn: 运动学分析涉及机器人运动几何关系的研究，不考虑引起运动的力和力矩。

source: In this analysis, the relation between the geometrical parameters of the manipulator with the final motion of the moving platform is derived and analyzed.
zh_cn: 本章推导和分析了机械臂几何参数与运动平台的最终运动之间的关系。

source: A parallel robot is a mechanism with a number of closed kinematic chains, and its moving platform is linked to the base by several independent kinematic chains.
zh_cn: 并联机器人是一个有大量闭环运动链的机械装置，它的运动平台通过几个独立的运动链连接到基座。

source: This definition of parallel robots is very extensive, and it includes redundant parallel manipulators with more actuators than the number of controlled degrees-of-freedom as well as under constrained parallel manipulators.
zh_cn: 上述并联机器人的定义被广泛接受和使用，它包括冗余并联机械臂和受限并联机械臂，冗余机械臂驱动器的个数要比它受控自由度的个数多。

source: Parallel robots for which the number of kinematic chains is equal to the number of degrees-of-freedom of the moving platform are called fully parallel robots.
zh_cn: 当运动链的个数和运动平台的自由度个数相同时，这种并联机器人称为全并联机器人。

source: If in addition to this condition, the type and number of joints at each limb, and the number and location of the actuated joints are identical in all the limbs, such a parallel robot is called symmetric.
zh_cn: 除这个条件外，如果并联机器人的各个支撑臂上的关节类型和数量都一样，且可驱动关节的数量和类型也都一样，则称这样的并联机器人是对称的。

source: Since kinematic analysis of symmetrical parallel manipulators is more convenient, this structure is used in many industrial robots, such as Stewart-Gough manipulator, or Delta robot.
zh_cn: 由于对称并联机械臂的运动学分析更为方便，因此许多工业机器人都采用这种结构，比如Stewart-Gough机械臂或Delta机器人。

source: There are three main cases for fully parallel manipulators.
zh_cn: 完全并联机械臂主要有三种类型。

source: Planar robots with two translation and one rotational degree-of-freedom in the plane; spatial orientation manipulators with three rotational degrees-of-freedom in space, and a general spatial robot with three translational and three rotational degrees-of-freedom in space.
zh_cn: 平面机器人在平面上有两个平移自由度和一个旋转自由度，空间方位机械臂在空间内有三个旋转自由度，而一般的空间机器人有三个平移自由度和三个旋转自由度。

source: Figure 3.1 illustrates a symmetrical planar parallel robot the limbs of which consist of an identical structure of three revolute joints, which can be named as 3RRR manipulator.
zh_cn: 图3-1 展示了一个对称平面机器人，它臂上的三个旋转关节有完全一致的结构，这种机器人被称作3RRR机械臂。

source: The underlined joint in this convention refers to the actuated one.
zh_cn: 本书约定加下划线的关节特指可驱动关节。

source: Figure 3.32 shows a redundant 4RRR similar to this manipulator, in which the first revolute joint is actuated.
zh_cn: 图3-32 展示了一个类似图3-1机械臂的冗余机械臂RRR，它的第一个旋转关节是可驱动关节。

source: As another planar robot, consider the manipulator shown in Figure 1.7.
zh_cn: 图1-7 所展示的机械臂是另一个平面机器人。

source: This manipulator is a redundant manipulator with the structure of 4RPR, which means a symmetrical limb structure of RPR is used and the prismatic joint is actuated.
zh_cn: 这个机械臂是一个有4RPR结构的冗余机械臂，这意味着它使用了一个RPR形式的对称臂结构，而且它的移动关节是可驱动的。

source: FIGURE 3.1 A symmetrical planar parallel robot
zh_cn: 图3-1 一个对称的平面并联机器人

source: Examples of spatial orientation manipulators are shown in Figures 3.33 and 3.10, in which the first manipulator is a fully parallel three-degrees-of-freedom manipulator, while the latter is a redundant parallel manipulator.
zh_cn: 如图3-33和图3-10 为空间方位机械臂的例子，前一个机械臂是完全并联的三自由度机械臂，后者是一个冗余并联机械臂。

source: Both manipulators are designed to provide a pure orientation motion for their moving platform.
zh_cn: 这两个机械臂都是为运动平台提供一个纯方位运动而设计的。

source: The first manipulator shown in Figure 3.33, consists of two tetrahedrals connected to each other by a spherical joint, limiting the motion of the moving platform into three rotational degrees-of-freedom.
zh_cn: 图3-33 所示的并联机械臂包括两个四面体，通过球形关节彼此连接，这样限制了运动平台的三个旋转自由度。

source: The limbs in this robot have an SPS structure, in which their prismatic joint is actuated.
zh_cn: 这个机械臂的臂是SPS结构，其中移动关节是可驱动的。

source: Likewise, in the redundant manipulator shown in Figure 3.10, which is called hydraulic shoulder manipulator, the passive link which is connected to the base with a spherical joint (S6), limits the motion of the moving platform to only three rotational degrees-of-freedom.
zh_cn: 同样的，图3-10 所示的液压驱动的肩机械臂是一个冗余机械臂，其中一根被动连杆通过一个球形关节（S6）连接到基座，它使运动平台的运动被限制到只有三个旋转自由度。

source: However, in this manipulator, four limbs with identical structures of UPU are used to generate a redundant parallel robot.
zh_cn: 然而在该机器人上，采用了完全一致的4个UPU结构的臂以构成冗余的并联机器人。

source: In this book, thorough kinematic analyses of both the redundant planar manipulator as well as the redundant spatial orientation manipulator are given, while the analysis of the fully parallel manipulators is left to the reader to be examined in the problems.
zh_cn: 本书中，给出了冗余的平面机械臂和冗余的空间方位机械臂详尽的运动学分析，而完全并联机械臂则作为习题留给读者进行分析。

source: The Stewart-Gough platform (SGP) is also adopted for the analysis of fully parallel six-degrees-of-freedom manipulators.
zh_cn: 完全的并联六自由度机械臂的分析也适用于SGP（Stewart-Gough平台）。

source: This manipulator consists of six identical limbs with an SPS structure.
zh_cn: 这种机械臂包括完全一致的六个SPS结构的臂。

source: Although kinematic analysis of the SGP in its most general form has been considered by many researchers and fascinating results have been obtained, in this book, the closed-form solution of a special geometry of the SGP, which is called 6-6p SGP is chosen.
zh_cn: 虽然许多研究人员都研究过SGP的最一般形式的运动学分析并获得了很多出色的成果，但本书还是选择了被称作6-6p SGP的特殊几何 结构的SGP封闭形式解。

source: This is mainly due to the reason that the analytical forward kinematic solution of this manipulator is tractable and can be more easily followed by the reader than the other geometries.
zh_cn: 这主要是由于机械臂的正向运动学的解析解易于处理，并且相 比其他结构更易被读者接受。

source: The 6-6p SGP is shown in Figure 3.18.
zh_cn: 图3-18 展示了6-6p SGP结构的原理图。

source: It is known that unlike serial manipulators, inverse kinematic analysis of parallel robots is usually simple and straightforward.
zh_cn: 我们知道，和串联机器人不同，并联机器人的逆运动学分析通常更简单、更直接。

source: In most cases, limb variables may be computed independently using the given pose of the moving platform, and the solution in most cases even for redundant manipulators is uniquely determined.
zh_cn: 在大多数情况下，给定运动平台的位姿，臂的相关变量可以独立计算，并且即使是针对冗余机械臂，多数情况下这些变量的解也是唯一确定的。

source: However, forward kinematics of parallel manipulators is generally very complicated, and its solution usually involves systems of nonlinear equations, which are highly coupled and in general have no closed form and unique solution.
zh_cn: 然而，并联机器人的正向运动学计算一般是很复杂的，而且它的解通常包含着相互耦合的非线性方程组，通常得不到封闭形式的解和唯一的解。

source: Different approaches are given in the literature to solve this problem either in general or in special cases.
zh_cn: 本书针对通用情形和特殊情形，给出了解决此问题的不同求解方法。

source: In general, different solutions to the forward kinematic problem of parallel manipulators can be found by using numerical or analytical approaches.
zh_cn: 通常情况下，并联机械臂的正向运动学问题的不同解可以使用数值方法或分析方法得到。

source: In what follows, a systematic means to perform kinematic analysis of parallel manipulators is given and this method is examined through the above-mentioned three selected case studies.
zh_cn: 在下文中，给出了一个进行并联机械臂运动学分析系统的方法，并且选择了上文提到的三个案例进行研究，检验了这种方法的有效性。

source: 3.2 Loop Closure Method
zh_cn: 3.2 封闭环方法

source: As illustrated in Figure 3.2, a typical parallel manipulator consists of two main bodies.
zh_cn: 如图3-2所示，一个典型的并联机械臂包括两个主要的部分。

source: Body A is arbitrarily designated as fixed and is called the base, while body B is designed to be movable and is called the moving platform, or sometimes the end effector.
zh_cn: A部分称作基座，一般设计成固定的，B部分设计成可移动的，称作运动平台，有时也称作末端执行器材。

source: These two bodies are coupled via n limbs, each attached to points Ai and Bi, and called fixed-and moving-attachment points of the limb i, respectively.
zh_cn: 这两部分是通过n个臂连接成的，每个臂连接到点Ai和点Bi两个点上，这两个点分别称作臂上的固定连接点和移动连接点。

source: At the displacement level, the forward kinematic problem pertains to the determination of the actual location or pose of the moving platform relative to the base from a set of joint-position readouts.
zh_cn: 在位移方面，正向运动学问题就是通过一组关节位置的测量值确定运动平台相对于基座的确切位置或姿态。

source: At the velocity level, the forward kinematic problem refers to the determination of the actual twist, that is, the translational and angular velocities of the moving platform relative to the base, from a set of joint-velocity readouts and for a known configuration.
zh_cn: 在速度方面，正向运动学问题涉及从一组关节速度的测量值和已知的结构确定实际的扭转速度，即运动平台相对基座的平移速度和角速度。

source: Since the properties of parallel manipulators are usually complementary to those of serial architectures, they can be used in situations where the properties of the latter do not meet the application requirements.
zh_cn: 由于并联机械臂的特性通常能弥补串联结构的不足，因此它常用于串联机械臂不能满足应用需求的场合。

source: However, the higher degree of complexity of parallel mechanisms leads to more challenging forward kinematic problems, at both the displacement and velocity levels.
zh_cn: 然而，不论是在位移方面还是速度方面，并联机械结构复杂程度越高，正向运动学问题越有挑战性。

source: The complexity of the forward kinematic problems depends extensively on the architecture, geometry, and joint-sensor layouts.
zh_cn: 正向运动学的复杂程度取决于机器人架构的广泛性、几何结构和关节传感器的布置。

source: FIGURE 3.2 Vector-loop closures in a general parallel manipulator.
zh_cn: 图3-2 一个一般并联机械臂的向量封闭环结构

source: To describe the motion of the moving platform relative to the base, attach frame {A} to body A and frame {B} to body B, as shown in Figure 3.2.
zh_cn: 为描述运动平台相对基座的运动，将坐标系{A}附在主体A上，坐标系 {B}附在主体B上，如图3-2所示。

source: The pose of the moving platform relative to the base is thus defined by a position vector p in addition to a rotation matrix R, in which p denotes the position vector of the origin of {B} with respect to frame {A}, and furthermore, the orientation of {B} with respect to {A} is represented by a 3 x 3 rotation matrix R.
zh_cn: 运动平台相对于基座的姿态是这样定义的，通过一个位置向量p和一个旋转矩阵R，p表示 {B} 的原点相对于坐标系{A}的位置向量。另外，{B}相对于{A}的方位通过一个3X3的旋转矩阵R来表示。

source: Each limb of a parallel manipulator defines a kinematic loop passing through the origins of frames {A} and {B}, and through the two limb attachment points Ai and Bi.
zh_cn: 并联机械臂的每个臂定义一个运动环，它通过坐标系{A}和{B}的原点，也通过两个臂的连接点Ai和Bi。

source: At the displacement level, the closure of each kinematic loop can be expressed in the vector form as . . . in which . . . and . . . can be easily obtained from the geometry of the attachment points in the base and in the moving platform.
zh_cn: 在位移方面，每个运动封闭环可以通过向量形式表示为：. . .. . .和. . .很容易通过基座和运动平台的连接点的几何结构得到。

source: Let us define vector ai = . . . in the fixed frame {A}i, and bi =. . . in the moving frame {B}.
zh_cn: 我们定义固定坐标 系{A}中的向量ai=. . .和移动坐标系{B}中的向量bi=. . .。

source: Furthermore, qi= . . . is defined as the limb variable, which indicates the geometry of the limb, and generally includes the active and passive limb segments.
zh_cn: 另外，qi=. . .定义为臂的变量，它表明了臂的几何结构，而且通常包含了主动和被动的臂分支。

source: Hence, the loop closure can be written as the unknown pose variables p, and R, the position vectors describing the known geometry of the base and the moving platform, ai and bi. Furthermore, the limb vector qi is only known from the kinematic equation of the limb together with the readouts of the position sensors located at the different joints of that limb.
zh_cn: 因此，闭环可以写 成未知的位姿变量P和R，以及描述基座和运动平台几何的位置向量ai和bi，此外，臂向量qi只要有臂的运动学方程和固定在臂的不同关节上的位置传感器的测量值就可以得到。

source: Therefore, one may write the loop closure equations as follows: . . .
zh_cn: 因此，我们可以得到封闭环方程如下所示：. . .

source: These equations are the main body of kinematic analysis.
zh_cn: 这些方程是运动学分析的主体部分。

source: For an inverse kinematic problem, it is assumed that the moving platform position p and orientation R are given and the problem is to solve the active limb variables.
zh_cn: 逆运动学问题是首先假定运动平台位置向量p和方位向量R是给定的，然后求解对应的主动臂的变量。

source: Hence, from the above equations the passive limb variables must be eliminated to solve the inverse kinematic problem.
zh_cn: 因此，从上面的方程发现，必须消除被动臂变量才能求解逆运动学问题。

source: This analysis is usually straightforward and results in a unique solution for the limb variables, even for redundant parallel manipulators.
zh_cn: 上述这些分析通常是很简单的，并且即使是针对冗余的并联机械臂，一般也存在臂变量的唯一解。

source: However, the inverse solution is not straightforward, and usually numerical methods are used for forward kinematic solution.
zh_cn: 然而，逆运动学求解则不是很简单的，并且通常正向运动方程的解也需要通过数值方法得到。

source: In the proceeding sections, the inverse and forward kinematic analysis of three case studies are elaborated in detail.
zh_cn: 在接下来的部分中，将详细阐述三个例子的逆向和正向运动学分析。

source: 3.3 Kinematic Analysis of a Planar Manipulator
zh_cn: 3.3 并联机器人的运动学分析

source: In this section, the kinematics of a planar parallel manipulator is discussed in detail.
zh_cn: 在本节中，将详细讨论平面并联机械臂的运动学。

source: In this analysis, the mechanism kinematic structure is described first and then the geometry of the manipulator is elaborated.
zh_cn: 本节分析中首先描述机械运动结构，然后详细说明机械臂的运动关系。

source: Next, the inverse and forward kinematic analyses of the manipulator are worked out in detail.
zh_cn: 接着，详细讨论机械臂的逆向和正向运动学分析。

source: In order to verify the formulations, in Section 3.3.5, the simulation results for computation of inverse kinematics and forward kinematics of the manipulator are presented, and the accuracy of a numerical solution to forward kinematic problem is verified.
zh_cn: 为了验证这些公式，在3.3.5 节，呈现了机械臂逆向运动学和正向运动学计算的仿真结果，而且还验证了正向运动学数值解的精度。

source: 3.3.1 Mechanism Description
zh_cn: 3.3.1 机械机构描述

source: The architecture of a planar 4 RPR parallel manipulator considered here is shown in Figure 3.3.
zh_cn: 本节讨论如图3-3所示的平面4RPR并联机械臂的体系结构。

source: In this manipulator the moving platform is supported by four limbs of an identical kinematic structure.
zh_cn: 这种机械臂的运动平台由4个运动学结构完全一致的臂支撑。

source: Each limb connects the fixed base to the manipulator moving platform by a revolute joint (R), followed by an actuated prismatic joint (P), and another revolute joint (R).
zh_cn: 每个臂依次由一个旋转关节（R），一个可驱动的移动关节（P）和另一个旋转关节（R）组成，将固定基座和机器人的运动平台连在一起。

source: Hence, the total structure of the manipulator is 4RPR. The kinematic structure of a prismatic joint is used to model either a piston-cylinder actuator at each limb, or a cable-driven one.
zh_cn: 因此，机械臂的整体结构式为4RPR。臂上的移动关节具有一个活塞一气缸驱动器或一个缆线驱动器等，由移动关节的运动学结构建模。

source: In order to avoid singularities at the central position of the manipulator, the limbs are considered to be crossed.
zh_cn: 为了避免机械臂中心位置的奇异性，这些臂设计成交叉的。

source: Complete singularity analysis of the mechanism is presented in Section 4.6.2.
zh_cn: 完整的机械结构奇异性分析将在4. 6. 2节介绍。

source: FIGURE 3.3 The schematics of a 4RPR parallel manipulator.
zh_cn: 图3-3 一个4RPR并联机械臂的体系结构

source: As shown in Figure 3.3, Ai denotes the fixed base points of the limbs, Bi denotes point of connection of the limbs to the moving platform, Li denotes the limbs' lengths, and a denotes the limbs' angles.
zh_cn: 如图3-3 所示，Ai表示臂的固定基点，Bi表示各臂与运动平台的连接点，Li表示臂的长度，ai表示臂的角度。

source: The position of the center of the moving platform G is denoted by G = [xG, yG], and orientation of the manipulator moving platform is denoted by . . . with respect to the fixed coordinate frame.
zh_cn: 运动平台G的中心位置被表示为G = [xG， yG]，机械臂运动平台的方位用相对于固定坐标坐标系的角度. . .表示。

source: Hence, the manipulator possesses three-degrees-of-freedom X = [xG, yG, . . .], with one-degree-of-redundancy in the actuators.
zh_cn: 因此机械臂拥有三个自由度X = [xG， yG， . . .]，且具有四个驱动器，且驱动器还有一个冗余度。

source: 3.3.2 Geometry of the Manipulator
zh_cn: 3.3.2 机械臂的几何结构

source: For the purpose of analysis and as illustrated in Figure 3.4, a fixed frame O: xy is attached to the fixed base at point O, the center of the base point circle which passes through Ai's.
zh_cn: 如图3-4所示，为进行分析，在固定基座上建立一个固定的坐标系O： xy，坐标原点选择为O点，O点是过基点Ai的圆的圆心。

source: Moreover, another moving coordinate frame G: UV is attached to the manipulator moving platform at point G.
zh_cn: 另外，在机械臂运动平台的圆心点G上建立另一个运动坐标系G： UV。

source: Furthermore, assume that point Ai lies at a radial distance of RA from point O, and point Bi lies at a radial distance of RB from point G in the xy plane, when the manipulator is at a central location.
zh_cn: 进一步，当机械臂处于中心位置时，假设在xy平面上，点Ai离点O的径向距离是RA，点Bi离点G的径向距离是RB。

source: FIGURE 3.4 Kinematic configuration of the 4RPR planar manipulator.
zh_cn: 图3-4 4RPR平面机械臂的运动学结构

source: In order to specify the geometry of the manipulator, let us define . . . and . . . as the absolute angles of points Ai and Bi at the central configuration of the manipulator with respect to the fixed frame O. The instantaneous orientation angle of
zh_cn: 为了说明机械臂的几何结构，当运动平台处于中心位置时，我们定义机械臂结构的点Ai和点Bi相对于固定坐标系O的绝对角度是. . .和. . .。

source: Bi's is defined as . . .
zh_cn: Bi的瞬时方位角被定义为：. . .

source: Therefore, for each limb, i = 1,2,3,4, the positions of the base points Ai are given by . . .
zh_cn: 因此，对于每个臂，i=1，2，3，4，基点Ai的位置可表示为：. . .

source: 3.3.3 Inverse Kinematics
zh_cn: 3.3.3 逆向运动学

source: For inverse kinematic analysis, it is assumed that the position and orientation of the moving platform X = [xG, yG,. . .]T is given and the problem is to find the joint variables of the manipulator, L = [Li, L2, L3, L4]T.
zh_cn: 假设运动平台的位置和方位X = [xG， yG，. . .]T是给定的，逆向运动学分析的问题是 求取机械臂对应的关节变量L = [L1，L2， L3， L4]T。

source: From the geometry of the manipulator, as illustrated in Figure 3.4, the loop closure equation for each limb, i = 1,2,3,4, may be written as, . . .
zh_cn: 如图3-4 所阐述的机械臂几何结构，每个臂的封闭环方程可以写为：. . .其中，i=1，2，3，4。
